Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ནོར་བུ་རིན་པོ་ཆེ་སྐར་མའི་རྒྱལ་མཚན་འོད་ཀྱི་དཀྱིལ་འཁོར་སྣ་ཚོགས་ཀྱི་རྒྱན་དང་ལྡན་པའི་རི་རབ་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་རྒྱས་པར་དགང་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རིན་པོ་ཆེའི་རྒྱལ་པོ་རྡོ་རྗེའི་སྙིང་པོ་ཁ་དོག་སྣ་ཚོགས་ཅན། རྒྱན་རྣམ་པ་ཐ་དད་པའི་ཡུལ་དང་ལྡན་པའི་རི་རབ་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་རྒྱས་པར་དགང་བ་དང་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ནོར་བུ་རིན་པོ་ཆེ་འཛམ་བུའི་ཆུ་ཀླུང་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སྣང་བའི་ཡུལ་དང་ལྡན་པའི་རི་རབ་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་རྒྱས་པར་དགང་བ་དང་། ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རབ་ཏུ་སྣང་བའི་རི་རབ་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་ཀུན་ནས་ཁྱབ་པར་བྱིན་གྱིས་བརླབ་པ་དང་། སེམས་ཅན་གྱི་ཁམས་ཀྱི་ཡུལ་ཐམས་ཅད་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཚན་རབ་ཏུ་སྣང་བའི་རི་རབ་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་རྒྱས་པར་དགང་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཀྱི་ནམ་མཁའ་རིན་པོ་ཆེའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་སྦྱོར་བ་རབ་ཏུ་སྣང་བར་ཡོངས་སུ་སྟོན་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒྲ་འབྱིན་པའི་རི་རབ་ཀྱི་སྤྲིན་གྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་རྒྱས་པར་དགང་བ་དང་། ཕྱོགས་བཅུ་ཐམས་ཅད་རིན་པོ་ཆེའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་རབ་ཏུ་སྣང་བའི་འོད་དང་ལྡན་པའི་རི་རབ་ཀྱི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་རྒྱས་པར་འགེངས་པ་བྱེད་ཅིང་། མྱི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་ན་བ་དེར་ལྷགས་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ།
en: In the western direction, beyond an ocean of world realms as numerous as the atoms in countless buddha realms, there was the world realm Maṇi­sumerūvirocana­dhvaja­pradīpā, the Tathāgata Dharma­dhātu­jñāna­pradīpa’s buddha realm, where the bodhisattva Samanta­śrī­samudgata­tejorāja, together with bodhisattvas to the number of atoms in countless buddha realms, with the permission of the Bhagavat, rose up from that ocean of the assembly of followers, came to the Sahā world realm, and manifested the entire realm of phenomena being filled with clouds of Sumerus of banners, with various kinds of colors and with various kinds of perfume, that were as numerous as the atoms in countless buddha realms; the entire realm of phenomena being filled with clouds of Sumerus of flowers, with various kinds of colors and with various kinds of scents, as numerous as the atoms in countless buddha realms; the entire realm of phenomena being filled with clouds of Sumerus of incenses, with various kinds of colors and with various kinds of scents, as numerous as the atoms in countless buddha realms; the entire realm of phenomena being filled with clouds of Sumerus of kings of jewels, as numerous as the atoms in countless buddha realms, in forms resembling every kind of requisite, that have arisen from the brilliance of his pores; the entire realm of phenomena being filled with clouds of Sumerus of precious jewels, as numerous as the atoms in countless buddha realms, in the forms of various kinds of banners of stars in a display of circles of lights; the entire realm of phenomena being filled with clouds of Sumerus of kings of jewels, as numerous as the atoms in countless buddha realms, in the forms of various exceptional displays of the essence of vajras in various colors; the entire realm of phenomena being filled with clouds of Sumerus of precious jewels from the Jambu River that brilliantly illuminate all world realms, as numerous as the atoms in countless buddha realms; the entire realm of phenomena being filled with clouds of Sumerus of precious jewels, as numerous as the atoms in countless buddha realms, that filled the sky and illuminated the entire realm of phenomena; the entire realm of phenomena being filled with clouds of Sumerus of kings of jewels, as numerous as the atoms in countless buddha realms, that were in the form of the features of all tathāgatas; the entire realm of phenomena being filled with clouds of Sumerus of kings of jewels, as numerous as the atoms in countless buddha realms, that resounded with the bodhisattva conduct that revealed the images of the past practices of all tathāgatas; and the ten directions being filled with clouds of Sumerus of kings of jewels, as numerous as the atoms in countless buddha realms, that formed the images of the bodhimaṇḍas of all tathāgatas.

source: འཁོར་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས། ནུབ་ཕྱོགས་སུ་བརྟེན་ཏེ། ཁང་པ་བརྩེགས་པ་སྤོས་ཀྱི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་ལྷུན་དང་ལྡན་པ་མུ་ཏིག་གི་དྲ་བས་ཀུན་ནས་ཁྱབ་པ་དང་། སེང་གེའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེ་ལྷའི་དབང་པོ་རབ་ཏུ་སྣང་བའི་རྒྱལ་མཚན་གྱི་པདྨོའི་སྙིང་པོ་ཅན་དག་མངོན་པར་སྤྲུལ་ནས། རིན་པོ་ཆེ་གསེར་གྱི་དྲ་བས་ཀུན་ནས་བརྒྱན་པ་དང་། ཡིད་བཞིན་གྱི་རྒྱལ་པོའི་ཅོད་པན་བཅིངས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སུ་བྱིན་གྱིས་བརླབས་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་དོ། །བྱང་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེའི་གོས་ཡོངས་སུ་སྣང་བ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་དཔལ་རྣམ་པར་སྣང་བའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆགས་པ་མྱེད་པའི་དཔལ་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེས་གནང་ནས་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དེ་ནས་འཕགས་ཏེ། ནམ་མཁའི་དབྱིངས་རིན་པོ་ཆེའི་སྣམ་བུའི་སྤྲིན་གྱི་རྒྱན་གྱིས་བརྒྱན་པར་བྱིན་གྱིས་བརླབ་པ་དང་། ནམ་མཁའི་དབྱིངས་རིན་པོ་ཆེའི་གོས་ཁ་དོག་སེར་པོ་དང་། མདོག་སེར་པོའི་སྤྲིན་གྱི་རྒྱན་གྱིས་བརྒྱན་པར་བྱིན་གྱིས་བརླབ་པ་དང་། ནམ་མཁའི་དབྱིངས་རིན་པོ་ཆེའི་གོས་སྤོས་སྣ་ཚོགས་ཀྱིས་དྲི་ཞིམ་པོར་བྱས་པའི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབབ་པའི་རྒྱན་གྱིས་བརྒྱན་པར་བྱིན་གྱིས་བརླབ་པ་དང་། ནམ་མཁའི་དབྱིངས་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཉི་མའི་རྒྱལ་མཚན་གྱི་སྤྲིན་གྱི་རྒྱན་གྱིས་བརྒྱན་པར་བྱིན་གྱིས་བརླབ་པ་དང་། ནམ་མཁའི་དབྱིངས་ནོར་བུ་རིན་པོ་ཆེ་གསེར་གྱི་མདོག་ཤིན་ཏུ་འབར་བའི་སྤྲིན་གྱི་རྒྱན་གྱིས་བརྒྱན་པར་བྱིན་གྱིས་བརླབ་པ་དང་། ནམ་མཁའི་དབྱིངས་ནོར་བུའི་རྒྱལ་པོ་རིན་པོ་ཆེ་འབར་བའི་གོས་ཀྱི་སྤྲིན་གྱི་རྒྱན་གྱིས་བརྒྱན་པར་བྱིན་གྱིས་བརླབ་པ་དང་།
en: Together with his entourage, he approached the Bhagavat, bowed to the Bhagavat, and in the western direction emanated kūṭāgāras covered by the kings of perfumes and by networks of strings of pearls, each having in its center a lotus made of precious jewels like the banner of Devendra upon a lion throne, and he and his entourage seated themselves cross-legged upon the lotuses, with their bodhisattva bodies adorned with a precious network of gold and a crown of kings of wish-fulfilling jewels bound onto their heads.

source: ནམ་མཁའི་དབྱིངས་རིན་པོ་ཆེ་སྐར་མ་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་གྱིས་སྣ་ཚོགས་སུ་གྱུར་པའི་གོས་ཀྱི་སྤྲིན་གྱི་རྒྱན་གྱིས་བརྒྱན་པར་བྱིན་གྱིས་བརླབ་པ་དང་། ནམ་མཁའི་དབྱིངས་ཕྱོགས་བཅུ་ཀུན་ནས་ནོར་བུ་རིན་པོ་ཆེ་སྣམ་བུ་ཁྲ་བོའི་རྡོ་ལྟར་སྣང་བའི་སྤྲིན་གྱིས་ཡོངས་སུ་རྒྱས་པར་བྱིན་གྱིས་བརླབ་པ་དང་། ནམ་མཁའི་དབྱིངས་ཕྱོགས་བཅུ་ཀུན་ནས་རིན་པོ་ཆེའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བའི་དཔལ་རབ་ཏུ་འབར་བའི་འོད་དང་ལྡན་པའི་གོས་ཀྱི་སྤྲིན་གྱིས་ཡོངས་སུ་རྒྱས་པར་བྱིན་གྱིས་བརླབ་པ་དང་། ནམ་མཁའི་དབྱིངས་ཕྱོགས་བཅུ་ཀུན་ནས་ནོར་བུའི་རྒྱལ་པོ་སྣང་བ་ཤིན་ཏུ་གསལ་བས་ཕྱོགས་ཀྱི་དབྱིངས་རྣམ་པར་སྣང་བའི་གོས་ཀྱི་སྤྲིན་གྱིས་ཡོངས་སུ་རྒྱས་པར་བྱིན་གྱིས་བརླབ་པ་དང་། ནམ་མཁའི་དབྱིངས་རིན་པོ་ཆེའི་རྒྱལ་པོ་རྒྱ་མཚོའི་རྒྱན་གྱི་གོས་ཀྱི་སྤྲིན་གྱིས་ཀུན་ནས་ཡོག་པར་བྱིན་གྱིས་བརླབ་པ་བྱེད་ཅིང་། མྱི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་ན་བ་དེར་ལྷགས་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ།
en: In the northern direction, beyond an ocean of world realms as numerous as the atoms in countless buddha realms, there was the world realm Ratna­vastrāvabhāsa­dhvajā, the Tathāgata Dharma­dhātu­gagana­śrī­vairocana’s buddha realm, where the bodhisattva Asaṅga­śrī­rāja, together with bodhisattvas to the number of atoms in countless buddha realms, with the permission of the Bhagavat, rose up from that ocean of the assembly of followers, came to the Sahā world realm, and manifested the sky being adorned by clouds of precious cloth; manifested the sky being adorned by clouds of precious clothing of yellow color, yellow in appearance; manifested the sky being adorned by clouds of precious clothing perfumed by various scents; manifested the sky being adorned by clouds of clothing made of the kings of jewels that were like the banner of the sun; manifested the sky being adorned by clouds of clothing made of the kings of jewels that shone with the splendor of gold; manifested the sky being adorned by clouds of clothing made of the kings of jewels that shone with jewels; manifested the sky being adorned by clouds of precious clothing in the manifold forms of all the stars; manifested the ten directions of the sky being filled with clouds of clothing made of precious jewels that were like cloth of shining crystal; manifested the ten directions of the sky being filled with clouds of clothing made of kings of jewels that shone with glorious brightness; and manifested the sky being covered by clouds of clothing made of kings of jewels as an ocean of adornments.

source: འཁོར་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས། བྱང་ཕྱོགས་སུ་བརྟེན་ཏེ། རིན་པོ་ཆེའི་རྒྱལ་པོ་རྒྱ་མཚོ་ཡོངས་སུ་འབྱུང་བའི་ཁང་པ་བརྩེགས་པ་དང་། སེང་གེའི་ཁྲི་བཻ་ཌཱུརྱའི་པདྨོའི་སྙིང་པོ་ཅན་དག་མངོན་པར་སྤྲུལ་ནས། ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སེང་གེ་མཛེས་པའི་དྲ་བས་ཡོངས་སུ་བརྒྱན་པ་དང་། རིན་པོ་ཆེ་སྐར་མའི་རྒྱལ་མཚན་མགོ་ལ་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སུ་བྱིན་གྱིས་བརླབས་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་དོ། །
en: Together with his entourage, he approached the Bhagavat, bowed to the Bhagavat, and in the northern direction emanated kūṭāgāras of precious jewels that had emerged from oceans, each having in its center a lotus made of precious jewels like the banner of Devendra upon a lion throne, and he and his entourage seated themselves cross-legged upon the lotuses, with their bodhisattva bodies adorned with a network of beautiful lion images made of the kings of precious jewels and with precious star banners above their heads.

source: བྱང་དང་ཤར་གྱི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་ས་ཆེན་པོ་ཐམས་ཅད་དུ་མཛེས་པའི་རིན་པོ་ཆེ་འོད་ཟེར་གྱི་དྲ་བ་རབ་ཏུ་འགྱེད་པ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་མྱི་དམྱིགས་པའི་སྤྱན་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་སུ་ཤིན་ཏུ་འཕྲུལ་བའི་སྨོན་ལམ་ཟླ་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེས་གནང་ནས་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དེ་ནས་འཕགས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཁེབས་པར་བྱིན་གྱིས་བརླབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་སྤོས་ཀྱི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཁེབས་པར་བྱིན་གྱིས་བརླབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་བདུག་སྤོས་ཀྱི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཁེབས་པར་བྱིན་གྱིས་བརླབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་ཙན་དན་གྱི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཁེབས་པར་བྱིན་གྱིས་བརླབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་མེ་ཏོག་གི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཁེབས་པར་བྱིན་གྱིས་བརླབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཁེབས་པར་བྱིན་གྱིས་བརླབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་རྡོ་རྗེའི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཁེབས་པར་བྱིན་གྱིས་བརླབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་གསེར་གྱི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཁེབས་པར་བྱིན་གྱིས་བརླབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་གོས་ཀྱི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཁེབས་པར་བྱིན་གྱིས་བརླབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་པདྨོའི་ཁང་པ་བརྩེགས་པའི་སྤྲིན་གྱིས་ཀུན་ནས་ཁེབས་པར་བྱིན་གྱིས་བརླབ་པ་བྱེད་ཅིང་།
en: In the northeastern direction, beyond an ocean of world realms as numerous as the atoms in countless buddha realms, there was the world realm Sarva­mahā­pṛthivī­rāja­maṇi­raśmi­jāla­pramuktā, the Tathāgata Anilambha­cakṣuṣa’s buddha realm, where the bodhisattva Dharma­dhātu­sunirmita­praṇidhi­candra, together with bodhisattvas to the number of atoms in countless buddha realms, with the permission of the Bhagavat, rose up from that ocean of the assembly of followers, came to the Sahā world realm, and manifested all infinite world realms being covered by clouds of kūṭāgāras of precious materials; manifested all infinite world realms being covered by clouds of kūṭāgāras of perfumes; manifested all infinite world realms being covered by clouds of kūṭāgāras of incense; manifested all infinite world realms being covered by clouds of kūṭāgāras of sandalwood; manifested all infinite world realms being covered by clouds of kūṭāgāras of flowers; manifested all infinite world realms being covered by clouds of kūṭāgāras of jewels; manifested all infinite world realms being covered by clouds of kūṭāgāras of vajras; manifested all infinite world realms being covered by clouds of kūṭāgāras of gold; manifested all infinite world realms being covered by clouds of kūṭāgāras of clothing; and manifested all infinite world realms being covered by clouds of kūṭāgāras of lotuses.

source: མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་ན་བ་དེར་ལྷགས་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ། འཁོར་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས་བྱང་དང་ཤར་གྱི་ཕྱོགས་མཚམས་སུ་བརྟེན་ཏེ། ནོར་བུ་རིན་པོ་ཆེའི་ཁང་པ་བརྩེགས་པ་སྒོ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ལ་མངོན་པར་ལྟ་བ་དང་། སེང་གེའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྤོས་མཚུངས་པ་མྱེད་པའི་པད་མོའི་སྙིང་པོ་ཅན་དག་མངོན་པར་སྤྲུལ་ནས་རིན་པོ་ཆེའི་རྒྱལ་པོའི་མེ་ཏོག་གི་དྲ་བས་ཡོངས་སུ་བརྒྱན་པ་དང་། རིན་པོ་ཆེའི་རྒྱལ་པོ་མཛོད་སྣ་ཚོགས་ཀྱི་དྲ་བའི་ཅོད་པན་བཅིངས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སུ་བྱིན་གྱིས་བརླབས་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་དོ། །ཤར་དང་ལྷོའི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཀྱི་སྤྲིན་གྱིས་བརྒྱན་པའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ཀླུ་དབང་གི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་འོད་འཕྲོ་བ་དང་ལྡན་པའི་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེས་གནང་ནས་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དེ་ནས་འཕགས་ཏེ། ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་འོད་ཀྱི་དཀྱིལ་འཁོར་གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་སྤྲིན་གྱིས་ཀུན་ཏུ་ཁྱབ་པར་བྱ་བ་དང་། ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་རིན་པོ་ཆེ་ཁ་དོག་མཐའ་ཡས་པའི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་གྱིས་ཀུན་ཏུ་ཁྱབ་པར་བྱ་བ་དང་། ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་མཛོད་སྤུའི་ཁ་དོག་གི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་གྱིས་ཀུན་ཏུ་ཁྱབ་པར་བྱ་བ་དང་། ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཁ་དོག་ལྟ་བུའི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་གྱིས་ཀུན་ཏུ་ཁྱབ་པར་བྱ་བ་དང་། ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་པདྨོའི་སྙིང་པོ་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་གྱིས་ཀུན་ཏུ་ཁྱབ་པར་བྱ་བ་དང་།
en: Together with his entourage, he approached the Bhagavat, bowed to the Bhagavat, and in the northeastern direction emanated kūṭāgāras of precious jewels that had gateways that looked out upon the entire realm of phenomena, each having in its center, upon a lion throne, a lotus of precious jewels and unequaled perfume, and he and his entourage seated themselves cross-legged upon the lotuses, with their bodhisattva bodies adorned with a network of flowers made of the kings of precious jewels and turbans that were like a network of various treasures of kings of jewels bound upon their heads.

source: ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་ནོར་བུའི་རྒྱལ་པོ་རིན་པོ་ཆེའི་ཤིང་གི་ཡལ་གའི་དཀྱིལ་འཁོར་ལྟ་བུའི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་གྱིས་ཀུན་ཏུ་ཁྱབ་པར་བྱ་བ་དང་། ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་གཙུག་ཏོར་ལྟ་བུའི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་གྱིས་ཀུན་ཏུ་ཁྱབ་པར་བྱ་བ་དང་། ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་འཛམ་བུའི་ཆུ་ཀླུང་གི་གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་གྱིས་ཀུན་ཏུ་ཁྱབ་པར་བྱ་བ་དང་། ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་ཉི་མའི་ཁ་དོག་ལྟ་བུའི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་གྱིས་ཀུན་ཏུ་ཁྱབ་པར་བྱ་བ་དང་། ནམ་མཁའི་དབྱིངས་ཐམས་ཅད་ཟླ་བ་དང་། སྐར་མའི་ཚོགས་ཀྱི་ཁ་དོག་ལྟ་བུའི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་སྤྲིན་གྱིས་ཀུན་ཏུ་ཁྱབ་པར་བྱེད་ཅིང་། མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་ན་བ་དེར་ལྷགས་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ།
en: In the southeastern direction, beyond an ocean of world realms as numerous as the atoms in countless buddha realms, there was the world realm Gandha­megha­vyūha­dhvajā, the Tathāgata Nāgeśvararāja’s buddha realm, where the bodhisattva Dharmārciṣmattejorāja, together with bodhisattvas to the number of atoms in countless buddha realms, with the permission of the Bhagavat, rose up from that ocean of the assembly of followers, came to the Sahā world realm, and covered the entire sky with clouds of disks of light the color of gold, covered the entire sky with clouds of disks of light the infinite colors of jewels, covered the entire sky with clouds of disks of light the color of the ūrṇā hair of the tathāgatas, covered the entire sky with clouds of disks of light the color of various jewels, covered the entire sky with clouds of disks of light the color of the center of lotuses, covered the entire sky with clouds of disks of light the color of disks made of the branches of trees made of the precious kings of jewels, covered the entire sky with clouds of disks of light the color of the uṣṇīṣas of the tathāgatas, covered the entire sky with clouds of disks of light the color of Jambu River gold, covered the entire sky with clouds of disks of light the color of the sun, and covered the entire sky with clouds of disks of light the color of the moon and the stars.

source: འཁོར་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས། ཤར་དང་ལྷོའི་ཕྱོགས་མཚམས་སུ་བརྟེན་ཏེ། རིན་པོ་ཆེ་རྡུལ་དང་བྲལ་ཞིང་རྣམ་པར་སྣང་བ་ཕུན་སུམ་ཚོགས་པའི་མེ་ཏོག་གི་ཁང་པ་བརྩེགས་པ་དང་། སེང་གེའི་ཁྲི་རིན་པོ་ཆེ་སེང་གེ་རྡོ་རྗེའི་པདྨོའི་སྙིང་པོ་ཅན་དག་མངོན་པར་སྤྲུལ་ནས་ནོར་བུའི་རྒྱལ་པོ་རིན་པོ་ཆེའི་འོད་ཟེར་རབ་ཏུ་འབར་བའི་དྲ་བས་ཡོངས་སུ་བརྒྱན་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སུ་བྱིན་གྱིས་བརླབས་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་དོ། །
en: Together with his entourage, he approached the Bhagavat, bowed to the Bhagavat, and in the southeastern direction emanated kūṭāgāras of perfect shining flowers of pristine jewels, each having in its center a lotus of lion-vajra jewels upon a lion throne, and he and his entourage seated themselves cross-legged upon the lotuses, their bodhisattva bodies adorned with a network of precious kings of brightly shining jewels.

source: ལྷོ་དང་ནུབ་ཀྱི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་ཉི་མ་རབ་ཏུ་སྣང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་འཁོར་ལོའི་ཡེ་ཤེས་ཀུན་ཏུ་སྣང་བའི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་འཐོར་བའི་ཡེ་ཤེས་རྒྱལ་མཚན་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེས་གནང་ནས། འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དེ་ནས་འཕགས་ཏེ། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་མེ་ཏོག་འོད་འཕྲོ་བའི་སྤྲིན་ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པ་རབ་ཏུ་དགྱེ་བ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་རོལ་མོ་འོད་འཕྲོ་བའི་སྤྲིན་ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པ་རབ་ཏུ་དགྱེ་བ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ནོར་བུ་རིན་པོ་ཆེ་འོད་འཕྲོ་བའི་སྤྲིན་ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པ་རབ་ཏུ་དགྱེ་བ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་རིན་པོ་ཆེའི་གོས་འོད་འཕྲོ་བའི་སྤོས་དང་། བདུག་སྤོས་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་བདུགས་པའི་སྤྲིན་ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པ་རབ་ཏུ་དགྱེ་བ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ཀླུས་རྣམ་པར་སྤྲུལ་པའི་གློག་གི་འོད་འཕྲོ་བའི་སྤྲིན་ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པ་རབ་ཏུ་དགྱེ་བ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ནོར་བུ་རིན་པོ་ཆེ་རྣམ་པར་སྣང་བ་འོད་འཕྲོ་བའི་སྤྲིན་ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པ་རབ་ཏུ་དགྱེ་བ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ནོར་བུ་རིན་པོ་ཆེ་གསེར་རབ་ཏུ་འབར་བ་འོད་རབ་ཏུ་འཕྲོ་བའི་སྤྲིན་ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པ་རབ་ཏུ་དགྱེ་བ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་རིན་པོ་ཆེའི་རྒྱལ་པོ་དཔལ་གྱི་སྙིང་པོ་འབར་བ་འོད་འཕྲོ་བའི་སྤྲིན་ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པ་རབ་ཏུ་དགྱེ་བ་དང་། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་ནོར་བུ་རིན་པོ་ཆེ། དེ་བཞིན་གཤེགས་པའི་དགོངས་པ་རྒྱ་མཚོ་ལྟར་དུས་གསུམ་གྱི་རྒྱུད་རབ་ཏུ་སྣང་བའི་ཚུལ་དང་ལྡན་པའི་འོད་འཕྲོ་བའི་སྤྲིན་ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པ་རབ་ཏུ་དགྱེ་བ་བྱེད་ཅིང་། མྱི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་ན་བ་དེར་ལྷགས་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ།
en: In the southwestern direction, beyond an ocean of world realms as numerous as the atoms in countless buddha realms, there was the world realm Maṇi­sūrya­pratibhāsa­garbhā, the Tathāgata Dharma­candra­samanta­jñānāvabhāsa­rāja’s buddha realm, where the bodhisattva Sarva­māra­maṇḍala­vikiraṇa­jñāna­dhvaja, together with bodhisattvas to the number of atoms in countless buddha realms, with the permission of the Bhagavat, rose up from that ocean of the assembly of followers, came to the Sahā world realm, and emanated from all his pores clouds of light rays from flowers, which were as vast as the element of space; emanated from all his pores clouds of light rays from musical instruments, which were as vast as the element of space; emanated from all his pores clouds of light rays from precious jewels, which were as vast as the element of space; emanated from all his pores clouds of light rays from precious clothing perfumed by incenses and perfumes of all kinds, which were as vast as the element of space; emanated from all his pores clouds of light rays from lightning emanated by nāgas, which were as vast as the element of space; emanated from all his pores clouds of light rays from bright, precious jewels, which were as vast as the element of space; emanated from all his pores clouds of light rays from shining gold and precious jewels, which were as vast as the element of space; emanated from all his pores clouds of light rays from shining kings of jewels that were the essence of splendor, which were as vast as the element of space; and emanated from all his pores clouds of light rays from precious jewels that had the nature of illuminating the extent of the three times, like the ocean of the awareness of the tathāgatas, spreading throughout the element of space.

source: འཁོར་དང་བཅས་པས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས། ལྷོ་དང་ནུབ་ཀྱི་ཕྱོགས་མཚམས་སུ་བརྟེན་ཏེ། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་འོད་ཟེར་གྱི་དྲ་བ་ཕྱོགས་ཀུན་ཏུ་མངོན་པར་གཞོལ་བའི་ཐིག་ལེས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་རབ་ཏུ་སྣང་བའི་ཁང་པ་བརྩེགས་པ་དང་། སེང་གེའི་ཁྲི་ནོར་བུ་རིན་པོ་ཆེ་སྤོས་ཀྱི་སྒྲོན་མ་འོད་འཕྲོ་བའི་པདྨོའི་སྙིང་པོ་ཅན་དག་མངོན་པར་སྤྲུལ་ནས། རིན་པོ་ཆེའི་རྒྱལ་པོ་དྲི་མ་མེད་པའི་སྙིང་པོའི་དྲ་བས་ཡོངས་སུ་བརྒྱན་པ་དང་། རིན་པོ་ཆེའི་རྒྱལ་པོ་སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་འཛུད་པའི་དབྱངས་དང་ལྡན་པའི་ཅོད་པན་བཅིངས་པའི་བྱང་ཆུབ་སེམས་དཔའི་ལུས་སུ་བྱིན་གྱིས་བརླབས་ནས་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་འཁོད་དོ། །ནུབ་དང་བྱང་གི་ཕྱོགས་མཚམས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་གྱི་འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དཔལ་གྱི་རི་བོ་ཀུན་ནས་རྣམ་པར་སྣང་བའི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་བའི་སྨོན་ལམ་ཡེ་ཤེས་དཔལ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དང་ལྷན་ཅིག་ཏུ། བཅོམ་ལྡན་འདས་དེས་གནང་ནས་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དེ་ནས་འཕགས་ཏེ། མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་དང་། ལུས་ཐམས་ཅད་ནས་དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་གཟུགས་བརྙན་གྱི་སྤྲིན་ཀུན་ཏུ་དགྱེ་བ་དང་། མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཐམས་ཅད་དང་། བ་སྤུའི་སྒོ་ཐམས་ཅད་དང་།
en: Together with his entourage, he approached the Bhagavat, bowed to the Bhagavat, and in the southwestern direction emanated kūṭāgāras with networks of great precious jewels that illuminated the entire realm of phenomena, each having in its center a lotus that radiated light rays of perfumed lamps upon a lion throne, and he and his entourage seated themselves cross-legged upon the lotuses, with their bodhisattva bodies adorned with networks of the stainless essences of kings of jewels and with turbans of kings of jewels that emitted words that guided all beings bound upon their heads.
